{"pages":[{"url":"pages/documents.html.html","text":"Publications Parallelized Kalman-Filter-Based Reconstruction of Particle Tracks on Many-Core Processors and GPUs - Submitted to proceedings of Connecting The Dots / Intelligent Trackers 2017 (Orsay) arXiv:1705.02876 Kalman filter tracking on parallel architectures - Proceedings of the 22nd International Conference on Computing in High Energy and Nuclear Physics (CHEP 2016) (San Francisco) arXiv:1702.06359 Reconstructing Particle Trajectories in High Energy Physics with Xeon and Xeon Phi - Proceedings of Connecting The Dots 2016 (CTD2016) workshop (Vienna) arXiv:1605.05508 , Proceedings: DOI , pdf Kalman-Filter-Based Particle Tracking on Parallel Architectures at Hadron Colliders - Proceedings of the 2015 IEEE NSS/MIC Conference (San Diego, CA) arXiv:1601.08245 Kalman Filter Tracking on Parallel Architectures - Journal of Physics: Conference Series 664 (2015) 072008, Proceedings of the 21st International Conference on Computing in High Energy and Nuclear Physics (CHEP2015) (Okinawa) arXiv:1505.04540 Traditional Tracking with Kalman Filter on Parallel Architectures - Journal of Physics: Conference Series 608 (2015) 012057, Proceedings of 16th International workshop on Advanced Computing and Analysis Techniques in physics research (ACAT 2014) (Prague) arXiv:1409.8213 Presentations 4 Apr 2017 - Parallelized Kalman-Filter-Based Reconstruction of Particle Tracks on Many-Core Processors and GPUs, Part I - K.McDermott, CMS Offline/Computing R&D (Open Session at Apr2017 CMS Week) 8 Mar 2017 - Parallelized Kalman-Filter-Based Reconstruction of Particle Tracks on Many-Core Processors and GPUs - M.Lefebvre, Connecting The Dots / Intelligent Trackers (CTDWIT 2017) 12 Oct 2016 - Kalman Filter Tracking on Parallel Architectures - D.Riley, 22nd International Conference on Computing in High Energy and Nuclear Physics (CHEP 2016) 21 Sep 2016 - Reconstructing Particle Trajectories in High Energy Physics with Xeon and Xeon Phi - D.Abdurachmanov, Intel Xeon Phi User Group Meeting 2016 19 May 2016 - Kalman Filter Tracking on Parallel Architectures - K.McDermott, US CMS Collaboration Meeting 9 May 2016 - Particle Track Reconstruction for the Large Hadron Collider: Progress in Many-Core Parallel Computing - S.Lantz, Scientific Computing and Numerics (SCAN) Seminar (Cornell University) 16 Mar 2016 - Parallelized Tracking - G.Cerati, Future Trends in Nuclear Physics Computing workshop 22 Feb 2016 - Kalman Filter Tracking on Parallel Architectures - K.McDermott, Connecting The Dots 2016 (CTD2016) workshop (Vienna) 13 Jan 2016 - Kalman Filter Tracking on Parallel Architectures - G.Cerati, FNAL Computing Techniques Seminar 17 Nov 2015 - High Performance Computing in the Manycore Era: Challenges for Applications - S.Lantz, Center for Applied and Computational Mathematics (CACM) Seminar (Rochester Institute of Technology) 13 Apr 2015 - Vectorization and Parallelization of Track Reconstruction Codes for the Large Hadron Collider - P.Wittich and S.Lantz, Scientific Computing and Numerics (SCAN) Seminar (Cornell University) 13 Apr 2015 - Kalman Filter Tracking on Parallel Architectures - G.Cerati, 21st International Conference on Computing in High Energy and Nuclear Physics (CHEP2015)","tags":"pages","title":"Publications and Presentations"},{"url":"pages/.html","text":"The Large Hadron Collider (LHC) at CERN is the highest energy collider ever constructed. It consists of two counter-circulating proton beams made to interact in four locations around a 27 kilometer ring straddling the border between Switzerland and France. It is by some measures the largest man-made scientific device on the planet. The goal of the LHC is to probe the basic building blocks of matter and their interactions. For example, in 2012, the Higgs boson was discovered by the CMS and ATLAS collaborations. The LHC collides proton beams at the center of our detectors. By measuring the energy and momentum of the escaping particles, we infer the existence of massive particles that were created in the collisions and measure the massive particles' properties based on their decay products. The determination of the trajectories of charged particles (\"tracks\") from a set of positions of energy deposits from the various layers in our detector (\"hits\") plays a key role in identifying particles and measuring their charge and momentum. This pattern recognition problem—known as \"track reconstruction\" or simply \"tracking\"—is as a whole the most computationally complex and time-consuming step in the measurement process, as well as the most sensitive to increased activity in the detector, and traditionally, the least amenable to parallelized processing. This project aims to develop tracking algorithms based on the Kalman Filter for use in a collider experiment that are fully vectorized and parallelized. These will be usable with parallel processor architectures such as Intel's Xeon Phi and GPUs, but yet maintain and extend the physics performance required for the challenges for the High Luminosity LHC (HL-LHC) planned for the 2020s.","tags":"pages","title":""},{"url":"pages/team.html.html","text":"Project Team Peter Elmer (PI) - Princeton University, Department of Physics Peter Wittich (PI) - Cornell University, Department of Physics Avi Yagil (PI) - University of California, San Diego, Department of Physics Frank Wuerthwein (PI) - University of California San Diego, Department of Physics Matthieu Lefebvre - Princeton University, Research Computing Dan Riley - Cornell University, Department of Physics Kevin McDermott - Cornell University, Department of Physics Steve Lantz - Cornell University, Center for Advanced Computing Slava Krutelyov - University of California San Diego, Department of Physics Mario Masciovecchio - University of California San Diego, Department of Physics Matevz Tadel - University of California San Diego, Department of Physics Collaborators Giuseppe Cerati - Fermi National Accelerator Laboratory Acknowledgement This project is supported by National Science Foundation grants PHY-1520942, PHY-1520969, PHY-1521042 and PHY-1120138. Any opinions, findings, conclusions or recommendations expressed in this material are those of the developers and do not necessarily reflect the views of the National Science Foundation.","tags":"pages","title":""}]}